const capitalize = (str) =>
  str ? str.charAt(0).toUpperCase() + str.toLowerCase().slice(1) : '';

const hobbiesArray1 = [
    'путешествия',
    'Фотография',
    ['кулинария', 'СПОРТ', ['чтение', 'музыка']],
    'Танцы',
    'рисование',
    'ЙОГА',
    'Медитация',
    'Программирование',
    'Программирование', // повтор
  ];
  
  const hobbiesArray2 = [
    'Садоводство',
    'Волонтерство',
    ['коллекционирование', ['ТЕАТР', 'Кино', ['шахматы']]],
    'Плавание',
    'Велоспорт',
    'велоспорт', // повтор с другим регистром
    'Горные лыжи',
    ['Сноуборд', 'СЕРФИНГ'],
  ];
  
  const hobbiesArray3 = [
    ['СКАЛОЛАЗАНИЕ', 'бег'],
    'Теннис',
  'Гольф',
  ['Рыбалка', ['Охота', 'ПЕНИЕ']],
  'ИГРА НА МУЗЫКАЛЬНЫХ ИНСТРУМЕНТАХ',
  'иностранные языки',
  'История',
  'история', // повтор с другим регистром
  ['Археология', ['астрономия']],
  'Психология',
  ['Философия', ['Политика', ['Экономика']]],
];
const hobbiesArray4 = [
  'Мода',
  'Дизайн',
  ['Архитектура', 'живопись', ['Скульптура']],
  'Каллиграфия',
  'Рукоделие',
  ['ВЯЗАНИЕ', ['Вышивание']],
  'Гончарное дело',
  ['Деревообработка', ['металлообработка', ['ЭЛЕКТРОНИКА']]]
];

const rawhobbieOptions = [...hobbiesArray1, ...hobbiesArray2, ...hobbiesArray3, ...hobbiesArray4];


const newOptions = rawhobbieOptions.flat(3);

const hobbieOptions = newOptions.map(capitalize);

const uniqueOptions = [...new Set(hobbieOptions)];

uniqueOptions.sort();

export default uniqueOptions;
